<!DOCTYPE html>
<html >
<head>
<meta http-equiv="Content-Type" content="text/html; charset=US-ASCII">
<meta name="generator" content="hevea 2.29+5 of 2017-05-18">
<link rel="stylesheet" type="text/css" href="tutoriel.css">
<title>Pour commencer</title>
</head>
<body >
<a href="index.html"><img src="contents_motif.gif" alt="Up"></a>
<a href="tutoriel002.html"><img src="next_motif.gif" alt="Next"></a>
<hr>
<h2 id="sec1" class="section">1&#XA0;&#XA0;Pour commencer</h2>
<h3 id="sec2" class="subsection">1.1&#XA0;&#XA0;Interface</h3>
<p>
<a id="hevea_default0"></a>
Pour l&#X2019;instant, vous allez simplement saisir vos premi&#XE8;res
commandes. L&#X2019;interface offre bien d&#X2019;autres possibilit&#XE9;s que vous
d&#XE9;couvrirez ensuite. Elle appara&#XEE;t comme suit au lancement de <span style="font-family:monospace">Xcas</span>.</p><div class="center">
<img src="tutoriel001.png">
</div><p>
Vous pouvez la redimensionner. De haut en bas cette interface
fait appara&#XEE;tre&#XA0;:
</p><ul class="itemize"><li class="li-itemize">
une barre de menu cliquable&#XA0;: <code>Fich</code>, <code>Edit</code>,
<code>Cfg</code>, <code>Aide</code>, <code>CAS</code>,<code>Expression</code>,
<code>Cmd</code>,<code>Prg</code>,
<code>Graphic</code>, <code>Geo</code>,<code>Tableur</code>,&#X2026;<a id="hevea_default1"></a>
</li><li class="li-itemize">un onglet indiquant le nom de la session, ou <span style="font-family:monospace">Unnamed</span> si la session n&#X2019;a 
pas encore &#XE9;t&#XE9; sauvegard&#XE9;e (on peut ouvrir plusieurs sessions en 
parall&#XE8;le et donc avoir plusieurs onglets repr&#XE9;sentant ces sessions),
</li><li class="li-itemize">une zone de gestion de la session avec :
<ul class="itemize"><li class="li-itemize">
un bouton <code>?</code> pour ouvrir l&#X2019;index de l&#X2019;aide,
</li><li class="li-itemize">une barre-bouton <code>Save</code> pour sauvegarder la session, 
</li><li class="li-itemize">un bouton affichant la configuration du CAS
<code>Config: exact real ...</code> et permettant de la modifier,
</li><li class="li-itemize">un bouton rouge <code>STOP</code> permettant d&#X2019;interrompre un calcul trop long,
</li><li class="li-itemize">un bouton <code>Kbd</code> pour faire apparaitre un clavier ressemblant &#XE0; 
celui d&#X2019;une calculatrice (on peut le voir ci-dessus). Il peut faciliter vos 
saisies, peut faire afficher une fen&#XEA;tre de messages avec touche 
<span style="font-family:monospace">Kbd-&gt;msg</span> (ou avec le menu <span style="font-family:monospace">Cfg-&gt;Montrer-&gt;msg</span>) et afficher le bandeau 
des commandes avec la touche <span style="font-family:monospace">Kbd-&gt;cmds</span> (ou avec le menu 
<span style="font-family:monospace">Cfg-&gt;Montrer-&gt;bandeau</span>) 
</li><li class="li-itemize">un bouton <code>x</code> pour fermer la session,
</li></ul>
</li><li class="li-itemize">une zone rectangulaire blanche num&#XE9;rot&#XE9;e 1 (premi&#XE8;re ligne
de commande) dans laquelle vous pouvez taper
votre premi&#XE8;re commande (cliquez si n&#XE9;cessaire pour faire
apparaitre le curseur dans
cette ligne de commande)&#XA0;: <code>1+1</code>, suivi de la touche
"Entr&#XE9;e" ("Enter" ou "Return" selon les claviers).
Le r&#XE9;sultat appara&#XEE;t au-dessous, et une nouvelle ligne de commande
s&#X2019;ouvre, num&#XE9;rot&#XE9;e 2. 
</li></ul><p>
Vous pouvez modifier l&#X2019;aspect de l&#X2019;interface et sauvegarder vos
modifications pour les utilisations futures (menu <code>Cfg</code>).</p><p>Vous n&#X2019;avez pour l&#X2019;instant qu&#X2019;&#XE0;
entrer des commandes dans les lignes de commandes successives. 
Si vous utilisez la
version html de ce cours, vous pouvez copier-coller les commandes
propos&#XE9;es depuis votre navigateur. 
Chaque ligne de commande saisie est ex&#XE9;cut&#XE9;e par la
touche "Entr&#XE9;e". Essayez par exemple d&#X2019;ex&#XE9;cuter les
commandes suivantes :
</p><pre class="verbatim">1/3+1/4
sqrt(2)^5
solve(a*x^2+b*x+c,x)
50!
</pre><p>
Toutes les commandes sont gard&#XE9;es en m&#XE9;moire.
Vous pouvez donc remonter dans l&#X2019;historique de votre session pour faire 
afficher &#XE0; nouveau des commandes ant&#XE9;rieures avec <span style="font-family:monospace">Ctrl+</span>&#X2191;
pour par exemple les modifier. Essayez, par exemple, en modifiant les 
commandes pr&#XE9;c&#XE9;dentes d&#X2019;ex&#XE9;cuter aussi&#XA0;:
</p><pre class="verbatim">1/3+3/4
solve(a*x+b*x+c,x)
</pre><p>
On obtient alors </p><div class="center">
<img src="tutoriel002.png">
</div><p>
On peut alors voir apparaitre, sur la droite, une barre de scroll permettant de 
se d&#XE9;placer dans les niveaux de la session et ici par exemple d&#X2019;avoir 
acc&#XE8;s au niveau 8.
Le menu <code>Edit</code> vous permet de pr&#XE9;parer des sessions plus
&#XE9;labor&#XE9;es qu&#X2019;une simple succession de commandes. Vous pouvez
cr&#XE9;er des groupes de lignes de commandes (sections), 
ajouter des commentaires ou fusionner des niveaux en un seul niveau.
</p>
<h3 id="sec3" class="subsection">1.2&#XA0;&#XA0;Les commandes et l&#X2019;aide en ligne</h3>
<p>
Les commandes sont regroup&#XE9;es par th&#XE8;mes dans les
menus du bandeau sup&#XE9;rieur&#XA0;: <code>CAS</code>, <code>Expression</code>,<code>Cmds</code>,
<code>Prg</code>, <code>Graphic</code>,
<code>Geo</code>, <code>Tableur</code>, <code>Phys</code>, <code>Scolaire</code>, <code>Tortue</code>. 
Certains menus sont des menus dit menus "Assistant" parce que les commandes 
sont class&#XE9;es par th&#XE8;me et sont explicit&#XE9;es (menu <span style="font-family:monospace">CAS</span>) ou parce 
qu&#X2019;une boite de dialogue vous demande de 
pr&#XE9;ciser les param&#XE8;tres de la commande choisie (menu 
<span style="font-family:monospace">Tableur</span>&#X25B8;<span style="font-family:monospace">Maths</span> ou menu <span style="font-family:monospace">Graphic</span>).<br>
Les autres menus contiennent les noms des commandes : 
le menu <span style="font-family:monospace">Cmds</span> contient toutes les commandes de calcul formel, 
le menu <span style="font-family:monospace">Prg</span> contient toutes les commandes que l&#X2019;on utilise en 
programmation,
le menu <span style="font-family:monospace">Geo</span> contient toutes les commandes de g&#XE9;om&#XE9;trie...
Lorsqu&#X2019;on s&#XE9;lectionne une commande dans un menu, 
</p><ul class="itemize"><li class="li-itemize">
soit une boite de dialogue s&#X2019;ouvre vous permettant de sp&#XE9;cifier
les arguments de la commande (par exemple pour tracer une courbe
depuis le menu <code>Graphic</code> ou pour faire des statistiques depuis le menu 
<span style="font-family:monospace">Tableur</span>&#X25B8;<span style="font-family:monospace">Maths</span>,
</li><li class="li-itemize">soit la commande est recopi&#XE9;e dans la ligne de commande. Pour connaitre
la syntaxe de cette commande, appuyez sur le bouton <code>?</code> en haut &#XE0; 
gauche, ou faites afficher la zone de <code>Messages</code> (en utilisant le menu 
<code>Cfg-&gt;Montrer-&gt;msg</code>). <br>
Vous pouvez aussi :
<ul class="itemize"><li class="li-itemize">
ouvrir l&#X2019;index de l&#X2019;aide &#XE0; la commande s&#XE9;lectionn&#XE9;e
(cela est automatique si on a cocher la case 
<code>Aide index automatique</code> dans le menu de configuration 
g&#XE9;n&#XE9;rale : <code>Cfg</code>-&gt;<code>Configuration generale</code>). Il faut alors 
cliquer sur le bouton <span style="font-family:monospace">OK</span> pour que la commande soit recopi&#XE9;e dans la 
ligne de commande &#XE0; condition que le curseur soit dans une ligne de 
commande.<br>
utoriel.tex
Vous pouvez aussi cliquer sur le bouton
<code>Details</code> pour afficher la page du manuel correspondant &#XE0; la commande
dans votre navigateur. </li><li class="li-itemize">ouvrir automatiquement la page correspondante du manuel dans votre 
navigateur, en cochant la case <code>Aide HTML automatique</code> dans le menu de 
configuration g&#XE9;n&#XE9;rale (<code>Cfg</code>-&gt; <code>Configuration generale</code>).
</li></ul>
</li></ul><p>
Le menu <code>Aide</code> contient les diff&#XE9;rentes formes d&#X2019;aide possible&#XA0;:
un guide de l&#X2019;utilisateur (interface), un guide de r&#XE9;f&#XE9;rence
(<code>Manuels-&gt;Calcul formel</code>, aide detaill&#XE9;e sur chaque commande), 
un <code>Index</code> (liste des commandes class&#XE9;es par ordre 
alphab&#XE9;tique avec une ligne d&#X2019;entr&#XE9;e permettant de se d&#XE9;placer
facilement) et une recherche par mots clefs.
<a id="hevea_default2"></a>
<a id="hevea_default3"></a></p><p>Si vous connaissez d&#XE9;j&#XE0; le nom d&#X2019;une commande et que vous d&#XE9;sirez
v&#XE9;rifier sa syntaxe (par exemple <code>factor</code>), vous pouvez
saisir le d&#XE9;but du nom de commande 
(disons <code>fact</code>) puis taper sur la touche de tabulation
(situ&#XE9;e &#XE0; gauche de la touche A sur un clavier
fran&#XE7;ais) ou cliquer sur le bouton <code>?</code> en haut &#XE0; gauche. 
L&#X2019;index des commandes appara&#XEE;t alors dans une fen&#XEA;tre, positionn&#XE9; 
&#XE0; la premi&#XE8;re compl&#XE9;tion possible, avec une aide succinte sur chaque
commande. 
Par exemple, vous voulez factoriser un polyn&#XF4;me, vous supposez que le nom de
commande commence par <code>fact</code>, vous tapez donc <code>fact</code> puis
la touche de tabulation, vous s&#XE9;lectionnez &#XE0; la souris
<code>factor</code> (ou un des exemples) puis vous cliquez sur OK.</p><p>Vous pouvez aussi saisir <code>?factor</code> pour avoir l&#X2019;aide succinte
en r&#XE9;ponse. Si le nom que vous avez saisi n&#X2019;est pas reconnu, des
commandes proches vous sont sugg&#XE9;r&#XE9;es.</p>
<h3 id="sec4" class="subsection">1.3&#XA0;&#XA0;Entrer des commandes</h3>
<p>
L&#X2019;ex&#XE9;cution d&#X2019;une ligne se fait simplement par la touche "Entr&#XE9;e". 
Si on ne souhaite pas afficher le r&#XE9;sultat, on termine la ligne de commande
par <code>:;</code> et on valide avec "Entr&#XE9;e".
On peut &#XE9;diter plusieurs commandes &#XE0; la file avant leur ex&#XE9;cution
&#XE0; condition de les s&#XE9;parer par un point-virgule.</p><p>Au d&#XE9;but, de nombreuses erreurs proviennent d&#X2019;une
mauvaise traduction des math&#XE9;matiques&#XA0;: <span style="font-family:monospace">Xcas</span> ne peut pas les comprendre
telles que vous les &#XE9;crivez. Votre clavier vous
permet de taper <span style="font-style:italic">ax</span><sup>2</sup>+<span style="font-style:italic">bx</span>+<span style="font-style:italic">c</span>, mais votre ordinateur ne peut pas
comprendre que vous souhaitez &#XE9;lever <span style="font-style:italic">x</span> au carr&#XE9;, le multiplier
par <span style="font-style:italic">a</span>, etc&#X2026;&#XA0; Vous devez sp&#XE9;cifier chaque op&#XE9;ration, et la
syntaxe correcte est <code>a*x^2+b*x+c</code>. 
La multiplication doit &#XEA;tre not&#XE9;e par une &#XE9;toile 
dans les commandes, mais est not&#XE9;e par un point dans
les r&#XE9;ponses. Nous insistons sur le fait que pour <span style="font-family:monospace">Xcas</span>, <code>ax</code> est 
une variable dont le nom comporte deux lettres, et pas le produit de <code>a</code>
par <code>x</code>.</p><div class="center">
<table border=1  style="border-spacing:0;" class="cellpadding1"><tr><td style="text-align:center;border:solid 1px;white-space:nowrap"  colspan=2><span style="font-weight:bold">Op&#XE9;rations</span></td></tr>
<tr><td style="text-align:left;border:solid 1px;white-space:nowrap" ><code>+</code></td><td style="text-align:left;border:solid 1px;white-space:nowrap" >addition</td></tr>
<tr><td style="text-align:left;border:solid 1px;white-space:nowrap" ><code>-</code></td><td style="text-align:left;border:solid 1px;white-space:nowrap" >soustraction </td></tr>
<tr><td style="text-align:left;border:solid 1px;white-space:nowrap" ><code>*</code></td><td style="text-align:left;border:solid 1px;white-space:nowrap" >mutiplication </td></tr>
<tr><td style="text-align:left;border:solid 1px;white-space:nowrap" ><code>/</code></td><td style="text-align:left;border:solid 1px;white-space:nowrap" >division</td></tr>
<tr><td style="text-align:left;border:solid 1px;white-space:nowrap" ><code>^</code></td><td style="text-align:left;border:solid 1px;white-space:nowrap" >puissance </td></tr>
</table>
</div><p>
<a id="hevea_default4"></a>
<a id="hevea_default5"></a>
<a id="hevea_default6"></a>
<a id="hevea_default7"></a>
<a id="hevea_default8"></a></p><p>Modulo quelques pr&#XE9;cautions, l&#X2019;&#XE9;criture des formules est assez
directe. Les parenth&#XE8;ses ont le sens 
usuel pour sp&#XE9;cifier l&#X2019;ordre des op&#XE9;rations. Les crochets 
sont r&#XE9;serv&#XE9;s aux listes et aux indices.
Les priorit&#XE9;s entre op&#XE9;rations sont standard 
(la multiplication est prioritaire sur l&#X2019;addition, la puissance sur
la multiplication). Par exemple&#XA0;:
<a id="hevea_default9"></a>
<a id="hevea_default10"></a>
</p><ul class="itemize"><li class="li-itemize">
<code>2*a+b</code> retourne 2&#XB7; <span style="font-style:italic">a</span>+<span style="font-style:italic">b</span>
</li><li class="li-itemize"><code>a/2*b</code> retourne  <span style="font-style:italic">a</span>&#XB7; <span style="font-style:italic">b</span>/2<br>
</li><li class="li-itemize"><code>a/2/b</code> retourne  <span style="font-style:italic">a</span>/ 2/<span style="font-style:italic">b</span>
</li><li class="li-itemize"><code>normal(a/2/b)</code> retourne  <span style="font-style:italic">a</span>/2&#XB7; <span style="font-style:italic">b</span>
</li><li class="li-itemize"><code>a^2*b</code> retourne <span style="font-style:italic">a</span><sup>2</sup>&#XB7; <span style="font-style:italic">b</span>
</li></ul><p>
Dans le doute, il est toujours prudent de mettre des parenth&#XE8;ses 
pour s&#X2019;assurer que l&#X2019;ordre des op&#XE9;rations est celui souhait&#XE9;.</p><p>Les commandes sont num&#XE9;rot&#XE9;es, ainsi que les r&#XE9;ponses,
mais, si vous avez modifi&#XE9; une ligne de commande, celle-ci
garde le num&#XE9;ro qu&#X2019;elle avait. On peut rappeler par <code>ans()</code> (answer) la 
r&#XE9;ponse pr&#XE9;c&#XE9;dente c&#X2019;est &#XE0; dire la r&#XE9;ponse de la derni&#XE8;re commande
&#XE9;valu&#XE9;e.
<a id="hevea_default11"></a>
</p>
<hr>
<a href="index.html"><img src="contents_motif.gif" alt="Up"></a>
<a href="tutoriel002.html"><img src="next_motif.gif" alt="Next"></a>
</body>
</html>
